Revit 2024 API
ParameterTypeId.DoorFrameMaterial Property
 "Frame Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DoorFrameMaterial { get; }
Visual Basic
Public Shared ReadOnly Property DoorFrameMaterial As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DoorFrameMaterial {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace